In [15]:
import os
from dotenv import load_dotenv, find_dotenv
from sqlalchemy.engine import URL
from sqlalchemy import create_engine, text
import pandas as pd


env_path = find_dotenv(usecwd=True)
load_dotenv(dotenv_path=env_path, override=True)

# Confirming what Python actually sees
for k in ("DB_HOST","DB_PORT","DB_USER","DB_NAME"):
    print(k, "=", os.getenv(k))
print("PW set?:", bool(os.getenv("DB_PASSWORD")))  # True/False only

url = URL.create(
    drivername="mysql+pymysql",
    username=os.getenv("DB_USER"),
    password=os.getenv("DB_PASSWORD"),
    host=os.getenv("DB_HOST"),
    port=int(os.getenv("DB_PORT")),
    database=os.getenv("DB_NAME"),
)

# Showing the URL â€” check the username here
print("URL ->", url.render_as_string(hide_password=True))

engine = create_engine(url, pool_pre_ping=True)

with engine.connect() as conn:
    # Extra sanity checks to see what MySQL user/host 
    print("CURRENT_USER():", conn.execute(text("SELECT CURRENT_USER()")).scalar())
    print("USER():", conn.execute(text("SELECT USER()")).scalar())

    df = pd.read_sql(text("SELECT 1 AS test"), conn)
    print(df)

DB_HOST = 127.0.0.1
DB_PORT = 3306
DB_USER = Elisabeth
DB_NAME = us_data_job_listing_2022_to_2025
PW set?: True
URL -> mysql+pymysql://Elisabeth:***@127.0.0.1:3306/us_data_job_listing_2022_to_2025
CURRENT_USER(): Elisabeth@127.0.0.1
USER(): Elisabeth@localhost
   test
0     1

In [16]:
# Importing jobs_master database 

df = pd.read_sql("SELECT * FROM jobs_master", engine)
df.head(100)

,index,job_id,date,year,month,company_name,clean_title,seniority_level,location,employment_type,remote_work,job_skills,salary_hourly,salary_yearly,salary_standardized,website,skills_json
0,0,0,2023-08-04,2023,8,Meta,Data Analyst,None,Anywhere,Full-Time,1,"['tableau', 'r', 'python', 'sql']",NaN,122000.0,122000.0,linkedin,"[""tableau"", ""r"", ""python"", ""sql""]"
1,1,1,2023-08-04,2023,8,ATC,Data Analyst,None,United States,Full-Time,0,[],NaN,NaN,NaN,linkedin,[]
2,2,2,2023-08-04,2023,8,"Garmin International, Inc.",Data Analyst,None,"Olathe, KS",Full-Time,0,['sql'],NaN,NaN,NaN,indeed,"[""sql""]"
3,3,3,2023-08-04,2023,8,Upwork,Data Analyst,None,Anywhere,Contract,1,"['powerpoint', 'excel', 'power_bi']",20.00,NaN,41600.0,Upwork,"[""powerpoint"", ""excel"", ""power_bi""]"
4,4,4,2023-08-04,2023,8,Krispy Kreme,Data Analyst,None,United States,Contract,0,"['powerpoint', 'excel', 'outlook', 'word']",NaN,100000.0,100000.0,linkedin,"[""powerpoint"", ""excel"", ""outlook"", ""word""]"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,95,95,2023-08-04,2023,8,Walmart,Data Engineer,None,"Decatur, AR",Full-Time,0,"['postgres', 'hadoop', 'gcp', 'airflow', 'spar...",NaN,NaN,NaN,Recruiter.com,"[""postgres"", ""hadoop"", ""gcp"", ""airflow"", ""spar..."
96,96,96,2023-08-04,2023,8,ISG,Data Engineer,None,United States,Contract,0,"['power_bi', 'sas', 'sharepoint', 'snowflake',...",49.25,NaN,102440.0,linkedin,"[""power_bi"", ""sas"", ""sharepoint"", ""snowflake"",..."
97,97,97,2023-08-04,2023,8,Walmart,Data Engineer,None,"Centerton, AR",Full-Time,0,"['postgres', 'hadoop', 'gcp', 'airflow', 'spar...",NaN,NaN,NaN,Recruiter.com,"[""postgres"", ""hadoop"", ""gcp"", ""airflow"", ""spar..."
98,98,98,2023-08-04,2023,8,Walmart,Data Engineer,None,"Gravette, AR",Full-Time,0,"['postgres', 'hadoop', 'gcp', 'airflow', 'spar...",NaN,NaN,NaN,Recruiter.com,"[""postgres"", ""hadoop"", ""gcp"", ""airflow"", ""spar..."
99,99,99,2023-08-17,2023,8,KGS Technology Group,Data Analyst,None,Anywhere,Full-Time,1,"['excel', 'power_bi', 'tableau', 'r', 'python'...",NaN,NaN,NaN,built in,"[""excel"", ""power_bi"", ""tableau"", ""r"", ""python""..."

In [17]:
df_jobs_master = df.copy()

In [18]:
df_jobs_master.describe()

,index,job_id,year,month,remote_work,salary_hourly,salary_yearly,salary_standardized
count,61953.000000,61953.000000,61953.000000,61953.000000,61953.000000,5900.000000,4069.000000,10088.000000
mean,1139.077333,30976.000000,2023.389763,6.032718,0.451633,40.539588,104115.406718,92289.425683
std,690.256113,17884.434951,0.792175,3.789804,0.497659,22.214540,36024.388492,43277.933820
min,0.000000,0.000000,2022.000000,1.000000,0.000000,7.250000,29289.840000,15080.000000
25%,553.000000,15488.000000,2023.000000,3.000000,0.000000,23.265000,80000.180000,62400.000000
50%,1111.000000,30976.000000,2023.000000,5.000000,0.000000,33.500000,96500.000000,88400.000000
75%,1685.000000,46464.000000,2024.000000,10.000000,1.000000,55.000000,120000.000000,117500.000000
max,3228.000000,61952.000000,2025.000000,12.000000,1.000000,300.000000,550000.000000,624000.000000

In [19]:
df_jobs_master.columns

Index(['index', 'job_id', 'date', 'year', 'month', 'company_name',
       'clean_title', 'seniority_level', 'location', 'employment_type',
       'remote_work', 'job_skills', 'salary_hourly', 'salary_yearly',
       'salary_standardized', 'website', 'skills_json'],
      dtype='object')

In [20]:
# Load 2022  jobs data 
df_2022 = pd.read_sql("SELECT * FROM 2022_job_data", engine)

# Copy dataframe
df_2022_copy = df_2022.copy()

df_2022_copy.describe()

,job_id,index,year,month,remote_work,salary_hourly,salary_yearly,salary_standardized
count,16464.000000,16464.000000,16464.0,16464.000000,16464.000000,1818.000000,1131.000000,2961.000000
mean,10034.500000,1056.330904,2022.0,11.606596,0.496538,46.875536,106040.125610,100664.056084
std,5839.833673,624.523263,0.0,0.488520,0.500003,22.058664,30735.974156,40916.189331
min,1.000000,0.000000,2022.0,11.000000,0.000000,10.000000,42500.000000,20800.000000
25%,4116.750000,535.750000,2022.0,11.000000,0.000000,31.000000,85050.000000,69680.000000
50%,10935.500000,1021.500000,2022.0,12.000000,0.000000,45.000000,103781.000000,100000.000000
75%,15051.250000,1562.250000,2022.0,12.000000,1.000000,57.500000,122470.500000,122470.500000
max,19167.000000,2625.000000,2022.0,12.000000,1.000000,135.000000,217500.000000,280800.000000

In [21]:
# Load 2023 jobs data 
df_2023 = pd.read_sql("SELECT * FROM 2023_job_data", engine)

# Copy dataframe
df_2023_copy = df_2023

df_2023_copy.describe()

,job_id,index,year,month,remote_work,salary_hourly,salary_yearly,salary_standardized
count,33413.000000,33413.000000,33413.0,33413.000000,33413.000000,3767.000000,1880.000000,5658.000000
mean,16707.000000,1134.835393,2023.0,6.392721,0.437674,41.170166,101144.306755,90768.423270
std,9645.646609,714.296810,0.0,3.522935,0.496108,22.760203,31737.938135,43365.259619
min,1.000000,0.000000,2023.0,1.000000,0.000000,7.250000,29289.840000,15080.000000
25%,8354.000000,517.000000,2023.0,3.000000,0.000000,23.500000,81641.000000,61353.000000
50%,16707.000000,1102.000000,2023.0,7.000000,0.000000,33.500000,96500.000000,88400.000000
75%,25060.000000,1691.000000,2023.0,9.000000,1.000000,57.500000,111608.625000,116480.000000
max,33413.000000,3228.000000,2023.0,12.000000,1.000000,300.000000,300000.000000,624000.000000

In [22]:
# Load 2024 jobs data 
df_2024 = pd.read_sql("SELECT * FROM 2024_job_data", engine)

# Copy dataframe
df_2024_copy = df_2024

df_2024_copy.describe()

,job_id,index,year,month,remote_work,salary_hourly,salary_yearly,salary_standardized
count,16469.000000,16469.000000,16469.0,16469.000000,16469.000000,1326.000000,1411.000000,2766.000000
mean,8235.000000,1114.941709,2024.0,4.946202,0.529662,36.702560,106698.816701,91958.738599
std,4754.335127,681.705325,0.0,3.301617,0.499135,20.306962,40591.767997,44090.282453
min,1.000000,0.000000,2024.0,1.000000,0.000000,9.000000,40000.000000,18720.000000
25%,4118.000000,528.000000,2024.0,2.000000,0.000000,22.695000,80000.000000,60476.000000
50%,8235.000000,1076.000000,2024.0,4.000000,1.000000,33.000000,100000.000000,86410.000000
75%,12352.000000,1674.000000,2024.0,7.000000,1.000000,47.500000,125000.000000,115000.000000
max,16469.000000,3227.000000,2024.0,12.000000,1.000000,258.500000,550000.000000,550000.000000

In [23]:
# Load 2025 jobs data 
df_2025 = pd.read_sql("SELECT * FROM 2025_job_data", engine)

# Copy dataframe
df_2025_copy = df_2025

df_2025_copy.describe()

,job_id,index,year,month,remote_work,salary_hourly,salary_yearly,salary_standardized
count,6583.000000,6583.000000,6583.0,6583.000000,6583.000000,201.000000,401.000000,677.000000
mean,3292.000000,1289.971745,2025.0,2.276925,0.289837,34.932264,107144.976347,94142.825871
std,1900.492743,613.670297,0.0,1.042850,0.453721,18.359506,41121.503892,41114.547912
min,1.000000,0.000000,2025.0,1.000000,0.000000,10.000000,36091.000000,20800.000000
25%,1646.500000,859.000000,2025.0,1.000000,0.000000,19.070000,79202.215000,69562.570000
50%,3292.000000,1270.000000,2025.0,2.000000,0.000000,32.500000,97407.000000,85000.000000
75%,4937.500000,1775.500000,2025.0,3.000000,1.000000,47.440000,129780.000000,114990.000000
max,6583.000000,2620.000000,2025.0,4.000000,1.000000,90.000000,290000.000000,290000.000000